garyPenhook/PIC-Assembler/device_includes/pic16f18175.inc
// Register: LATC
#define LATC LATC
LATC                                     equ 001Ah
// bitfield definitions
LATC_LATC0_POSN                          equ 0000h
LATC_LATC0_POSITION                      equ 0000h
LATC_LATC0_SIZE                          equ 0001h
LATC_LATC0_LENGTH                        equ 0001h
LATC_LATC0_MASK                          equ 0001h
LATC_LATC1_POSN                          equ 0001h
LATC_LATC1_POSITION                      equ 0001h
LATC_LATC1_SIZE                          equ 0001h
LATC_LATC1_LENGTH                        equ 0001h
LATC_LATC1_MASK                          equ 0002h
LATC_LATC2_POSN                          equ 0002h
LATC_LATC2_POSITION                      equ 0002h
LATC_LATC2_SIZE                          equ 0001h
LATC_LATC2_LENGTH                        equ 0001h
LATC_LATC2_MASK                          equ 0004h
LATC_LATC3_POSN                          equ 0003h
LATC_LATC3_POSITION                      equ 0003h
LATC_LATC3_SIZE                          equ 0001h
LATC_LATC3_LENGTH                        equ 0001h
LATC_LATC3_MASK                          equ 0008h
LATC_LATC4_POSN                          equ 0004h
LATC_LATC4_POSITION                      equ 0004h
LATC_LATC4_SIZE                          equ 0001h
LATC_LATC4_LENGTH                        equ 0001h
LATC_LATC4_MASK                          equ 0010h
LATC_LATC5_POSN                          equ 0005h
LATC_LATC5_POSITION                      equ 0005h
LATC_LATC5_SIZE                          equ 0001h
LATC_LATC5_LENGTH                        equ 0001h
LATC_LATC5_MASK                          equ 0020h
LATC_LATC6_POSN                          equ 0006h
LATC_LATC6_POSITION                      equ 0006h
LATC_LATC6_SIZE                          equ 0001h
LATC_LATC6_LENGTH                        equ 0001h
LATC_LATC6_MASK                          equ 0040h
LATC_LATC7_POSN                          equ 0007h
LATC_LATC7_POSITION                      equ 0007h
LATC_LATC7_SIZE                          equ 0001h
LATC_LATC7_LENGTH                        equ 0001h
LATC_LATC7_MASK                          equ 0080h

// Register: LATD
#define LATD LATD
LATD                                     equ 001Bh
// bitfield definitions
LATD_LATD0_POSN                          equ 0000h
LATD_LATD0_POSITION                      equ 0000h
LATD_LATD0_SIZE                          equ 0001h
LATD_LATD0_LENGTH                        equ 0001h
LATD_LATD0_MASK                          equ 0001h
LATD_LATD1_POSN                          equ 0001h
LATD_LATD1_POSITION                      equ 0001h
LATD_LATD1_SIZE                          equ 0001h
LATD_LATD1_LENGTH                        equ 0001h
LATD_LATD1_MASK                          equ 0002h
LATD_LATD2_POSN                          equ 0002h
LATD_LATD2_POSITION                      equ 0002h
LATD_LATD2_SIZE                          equ 0001h
LATD_LATD2_LENGTH                        equ 0001h
LATD_LATD2_MASK                          equ 0004h
LATD_LATD3_POSN                          equ 0003h
LATD_LATD3_POSITION                      equ 0003h
LATD_LATD3_SIZE                          equ 0001h
LATD_LATD3_LENGTH                        equ 0001h
LATD_LATD3_MASK                          equ 0008h
LATD_LATD4_POSN                          equ 0004h
LATD_LATD4_POSITION                      equ 0004h
LATD_LATD4_SIZE                          equ 0001h
LATD_LATD4_LENGTH                        equ 0001h
LATD_LATD4_MASK                          equ 0010h
LATD_LATD5_POSN                          equ 0005h
LATD_LATD5_POSITION                      equ 0005h
LATD_LATD5_SIZE                          equ 0001h
LATD_LATD5_LENGTH                        equ 0001h
LATD_LATD5_MASK                          equ 0020h
LATD_LATD6_POSN                          equ 0006h
LATD_LATD6_POSITION                      equ 0006h
LATD_LATD6_SIZE                          equ 0001h
LATD_LATD6_LENGTH                        equ 0001h
LATD_LATD6_MASK                          equ 0040h
LATD_LATD7_POSN                          equ 0007h
LATD_LATD7_POSITION                      equ 0007h
LATD_LATD7_SIZE                          equ 0001h
LATD_LATD7_LENGTH                        equ 0001h
LATD_LATD7_MASK                          equ 0080h

// Register: LATE
#define LATE LATE
LATE                                     equ 001Ch
// bitfield definitions
LATE_LATE0_POSN                          equ 0000h
LATE_LATE0_POSITION                      equ 0000h
LATE_LATE0_SIZE                          equ 0001h
LATE_LATE0_LENGTH                        equ 0001h
LATE_LATE0_MASK                          equ 0001h
LATE_LATE1_POSN                          equ 0001h
LATE_LATE1_POSITION                      equ 0001h
LATE_LATE1_SIZE                          equ 0001h
LATE_LATE1_LENGTH                        equ 0001h
LATE_LATE1_MASK                          equ 0002h
LATE_LATE2_POSN                          equ 0002h
LATE_LATE2_POSITION                      equ 0002h
LATE_LATE2_SIZE                          equ 0001h
LATE_LATE2_LENGTH                        equ 0001h
LATE_LATE2_MASK                          equ 0004h

// Register: PIR0
#define PIR0 PIR0
PIR0                                     equ 008Ch
// bitfield definitions
PIR0_INTF_POSN                           equ 0000h
PIR0_INTF_POSITION                       equ 0000h
PIR0_INTF_SIZE                           equ 0001h
PIR0_INTF_LENGTH                         equ 0001h
PIR0_INTF_MASK                           equ 0001h
PIR0_IOCIF_POSN                          equ 0004h
PIR0_IOCIF_POSITION                      equ 0004h
PIR0_IOCIF_SIZE                          equ 0001h
PIR0_IOCIF_LENGTH                        equ 0001h
PIR0_IOCIF_MASK                          equ 0010h
PIR0_TMR0IF_POSN                         equ 0005h
PIR0_TMR0IF_POSITION                     equ 0005h
PIR0_TMR0IF_SIZE                         equ 0001h
PIR0_TMR0IF_LENGTH                       equ 0001h
PIR0_TMR0IF_MASK                         equ 0020h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 008Dh
// bitfield definitions
PIR1_NVMIF_POSN                          equ 0000h
PIR1_NVMIF_POSITION                      equ 0000h
PIR1_NVMIF_SIZE                          equ 0001h
PIR1_NVMIF_LENGTH                        equ 0001h
PIR1_NVMIF_MASK                          equ 0001h
PIR1_CRCIF_POSN                          equ 0001h
PIR1_CRCIF_POSITION                      equ 0001h
PIR1_CRCIF_SIZE                          equ 0001h
PIR1_CRCIF_LENGTH                        equ 0001h
PIR1_CRCIF_MASK                          equ 0002h
PIR1_SCANIF_POSN                         equ 0002h
PIR1_SCANIF_POSITION                     equ 0002h
PIR1_SCANIF_SIZE                         equ 0001h
PIR1_SCANIF_LENGTH                       equ 0001h
PIR1_SCANIF_MASK                         equ 0004h
PIR1_ACTIF_POSN                          equ 0003h
PIR1_ACTIF_POSITION                      equ 0003h
PIR1_ACTIF_SIZE                          equ 0001h
PIR1_ACTIF_LENGTH                        equ 0001h
PIR1_ACTIF_MASK                          equ 0008h
PIR1_CSWIF_POSN                          equ 0004h
PIR1_CSWIF_POSITION                      equ 0004h
PIR1_CSWIF_SIZE                          equ 0001h
PIR1_CSWIF_LENGTH                        equ 0001h
PIR1_CSWIF_MASK                          equ 0010h
PIR1_OSFIF_POSN                          equ 0005h
PIR1_OSFIF_POSITION                      equ 0005h
PIR1_OSFIF_SIZE                          equ 0001h
PIR1_OSFIF_LENGTH                        equ 0001h
PIR1_OSFIF_MASK                          equ 0020h
PIR1_TMR1IF_POSN                         equ 0006h
PIR1_TMR1IF_POSITION                     equ 0006h
PIR1_TMR1IF_SIZE                         equ 0001h
PIR1_TMR1IF_LENGTH                       equ 0001h
PIR1_TMR1IF_MASK                         equ 0040h
PIR1_TMR1GIF_POSN                        equ 0007h
PIR1_TMR1GIF_POSITION                    equ 0007h
PIR1_TMR1GIF_SIZE                        equ 0001h
PIR1_TMR1GIF_LENGTH                      equ 0001h
PIR1_TMR1GIF_MASK                        equ 0080h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 008Eh
// bitfield definitions
PIR2_TMR3IF_POSN                         equ 0000h
PIR2_TMR3IF_POSITION                     equ 0000h
PIR2_TMR3IF_SIZE                         equ 0001h
PIR2_TMR3IF_LENGTH                       equ 0001h
PIR2_TMR3IF_MASK                         equ 0001h
PIR2_TMR3GIF_POSN                        equ 0001h
PIR2_TMR3GIF_POSITION                    equ 0001h
PIR2_TMR3GIF_SIZE                        equ 0001h
PIR2_TMR3GIF_LENGTH                      equ 0001h
PIR2_TMR3GIF_MASK                        equ 0002h
PIR2_TMR2IF_POSN                         equ 0002h
PIR2_TMR2IF_POSITION                     equ 0002h
PIR2_TMR2IF_SIZE                         equ 0001h
PIR2_TMR2IF_LENGTH                       equ 0001h
PIR2_TMR2IF_MASK                         equ 0004h
PIR2_TMR4IF_POSN                         equ 0003h
PIR2_TMR4IF_POSITION                     equ 0003h
PIR2_TMR4IF_SIZE                         equ 0001h
PIR2_TMR4IF_LENGTH                       equ 0001h
PIR2_TMR4IF_MASK                         equ 0008h
PIR2_TMR6IF_POSN                         equ 0004h
PIR2_TMR6IF_POSITION                     equ 0004h
PIR2_TMR6IF_SIZE                         equ 0001h
PIR2_TMR6IF_LENGTH                       equ 0001h
PIR2_TMR6IF_MASK                         equ 0010h
PIR2_CCP1IF_POSN                         equ 0005h
PIR2_CCP1IF_POSITION                     equ 0005h
PIR2_CCP1IF_SIZE                         equ 0001h
PIR2_CCP1IF_LENGTH                       equ 0001h
PIR2_CCP1IF_MASK                         equ 0020h
PIR2_CCP2IF_POSN                         equ 0006h
PIR2_CCP2IF_POSITION                     equ 0006h
PIR2_CCP2IF_SIZE                         equ 0001h
PIR2_CCP2IF_LENGTH                       equ 0001h
PIR2_CCP2IF_MASK                         equ 0040h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 008Fh
// bitfield definitions
PIR3_PWM1PIF_POSN                        equ 0000h
PIR3_PWM1PIF_POSITION                    equ 0000h
PIR3_PWM1PIF_SIZE                        equ 0001h
PIR3_PWM1PIF_LENGTH                      equ 0001h
PIR3_PWM1PIF_MASK                        equ 0001h
PIR3_PWM1IF_POSN                         equ 0001h
PIR3_PWM1IF_POSITION                     equ 0001h
PIR3_PWM1IF_SIZE                         equ 0001h
PIR3_PWM1IF_LENGTH                       equ 0001h
PIR3_PWM1IF_MASK                         equ 0002h
PIR3_PWM2PIF_POSN                        equ 0002h
PIR3_PWM2PIF_POSITION                    equ 0002h
PIR3_PWM2PIF_SIZE                        equ 0001h
PIR3_PWM2PIF_LENGTH                      equ 0001h
PIR3_PWM2PIF_MASK                        equ 0004h
PIR3_PWM2IF_POSN                         equ 0003h
PIR3_PWM2IF_POSITION                     equ 0003h
PIR3_PWM2IF_SIZE                         equ 0001h
PIR3_PWM2IF_LENGTH                       equ 0001h
PIR3_PWM2IF_MASK                         equ 0008h
PIR3_PWM3PIF_POSN                        equ 0004h
PIR3_PWM3PIF_POSITION                    equ 0004h
PIR3_PWM3PIF_SIZE                        equ 0001h
PIR3_PWM3PIF_LENGTH                      equ 0001h
PIR3_PWM3PIF_MASK                        equ 0010h
PIR3_PWM3IF_POSN                         equ 0005h
PIR3_PWM3IF_POSITION                     equ 0005h
PIR3_PWM3IF_SIZE                         equ 0001h
PIR3_PWM3IF_LENGTH                       equ 0001h
PIR3_PWM3IF_MASK                         equ 0020h
PIR3_PWM4PIF_POSN                        equ 0006h
PIR3_PWM4PIF_POSITION                    equ 0006h
PIR3_PWM4PIF_SIZE                        equ 0001h
PIR3_PWM4PIF_LENGTH                      equ 0001h
PIR3_PWM4PIF_MASK                        equ 0040h
PIR3_PWM4IF_POSN                         equ 0007h
PIR3_PWM4IF_POSITION                     equ 0007h
PIR3_PWM4IF_SIZE                         equ 0001h
PIR3_PWM4IF_LENGTH                       equ 0001h
PIR3_PWM4IF_MASK                         equ 0080h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 0090h
// bitfield definitions
PIR4_NCO1IF_POSN                         equ 0000h
PIR4_NCO1IF_POSITION                     equ 0000h
PIR4_NCO1IF_SIZE                         equ 0001h
PIR4_NCO1IF_LENGTH                       equ 0001h
PIR4_NCO1IF_MASK                         equ 0001h
PIR4_CWG1IF_POSN                         equ 0001h
PIR4_CWG1IF_POSITION                     equ 0001h
PIR4_CWG1IF_SIZE                         equ 0001h
PIR4_CWG1IF_LENGTH                       equ 0001h
PIR4_CWG1IF_MASK                         equ 0002h
PIR4_CLC1IF_POSN                         equ 0002h
PIR4_CLC1IF_POSITION                     equ 0002h
PIR4_CLC1IF_SIZE                         equ 0001h
PIR4_CLC1IF_LENGTH                       equ 0001h
PIR4_CLC1IF_MASK                         equ 0004h
PIR4_CLC2IF_POSN                         equ 0003h
PIR4_CLC2IF_POSITION                     equ 0003h
PIR4_CLC2IF_SIZE                         equ 0001h
PIR4_CLC2IF_LENGTH                       equ 0001h
PIR4_CLC2IF_MASK                         equ 0008h
PIR4_CLC3IF_POSN                         equ 0004h
PIR4_CLC3IF_POSITION                     equ 0004h
PIR4_CLC3IF_SIZE                         equ 0001h
PIR4_CLC3IF_LENGTH                       equ 0001h
PIR4_CLC3IF_MASK                         equ 0010h
PIR4_CLC4IF_POSN                         equ 0005h
PIR4_CLC4IF_POSITION                     equ 0005h
PIR4_CLC4IF_SIZE                         equ 0001h
PIR4_CLC4IF_LENGTH                       equ 0001h
PIR4_CLC4IF_MASK                         equ 0020h
PIR4_TX1IF_POSN                          equ 0006h
PIR4_TX1IF_POSITION                      equ 0006h
PIR4_TX1IF_SIZE                          equ 0001h
PIR4_TX1IF_LENGTH                        equ 0001h
PIR4_TX1IF_MASK                          equ 0040h
PIR4_RC1IF_POSN                          equ 0007h
PIR4_RC1IF_POSITION                      equ 0007h
PIR4_RC1IF_SIZE                          equ 0001h
PIR4_RC1IF_LENGTH                        equ 0001h
PIR4_RC1IF_MASK                          equ 0080h

