garyPenhook/PIC-Assembler/device_includes/pic16f18175.inc
// Register: RA3PPS
#define RA3PPS RA3PPS
RA3PPS                                   equ 01D8Fh
// bitfield definitions
RA3PPS_RA3PPS_POSN                       equ 0000h
RA3PPS_RA3PPS_POSITION                   equ 0000h
RA3PPS_RA3PPS_SIZE                       equ 0006h
RA3PPS_RA3PPS_LENGTH                     equ 0006h
RA3PPS_RA3PPS_MASK                       equ 003Fh

// Register: RA4PPS
#define RA4PPS RA4PPS
RA4PPS                                   equ 01D90h
// bitfield definitions
RA4PPS_RA4PPS_POSN                       equ 0000h
RA4PPS_RA4PPS_POSITION                   equ 0000h
RA4PPS_RA4PPS_SIZE                       equ 0006h
RA4PPS_RA4PPS_LENGTH                     equ 0006h
RA4PPS_RA4PPS_MASK                       equ 003Fh

// Register: RA5PPS
#define RA5PPS RA5PPS
RA5PPS                                   equ 01D91h
// bitfield definitions
RA5PPS_RA5PPS_POSN                       equ 0000h
RA5PPS_RA5PPS_POSITION                   equ 0000h
RA5PPS_RA5PPS_SIZE                       equ 0006h
RA5PPS_RA5PPS_LENGTH                     equ 0006h
RA5PPS_RA5PPS_MASK                       equ 003Fh

// Register: RA6PPS
#define RA6PPS RA6PPS
RA6PPS                                   equ 01D92h
// bitfield definitions
RA6PPS_RA6PPS_POSN                       equ 0000h
RA6PPS_RA6PPS_POSITION                   equ 0000h
RA6PPS_RA6PPS_SIZE                       equ 0006h
RA6PPS_RA6PPS_LENGTH                     equ 0006h
RA6PPS_RA6PPS_MASK                       equ 003Fh

// Register: RA7PPS
#define RA7PPS RA7PPS
RA7PPS                                   equ 01D93h
// bitfield definitions
RA7PPS_RA7PPS_POSN                       equ 0000h
RA7PPS_RA7PPS_POSITION                   equ 0000h
RA7PPS_RA7PPS_SIZE                       equ 0006h
RA7PPS_RA7PPS_LENGTH                     equ 0006h
RA7PPS_RA7PPS_MASK                       equ 003Fh

// Register: RB0PPS
#define RB0PPS RB0PPS
RB0PPS                                   equ 01D94h
// bitfield definitions
RB0PPS_RB0PPS_POSN                       equ 0000h
RB0PPS_RB0PPS_POSITION                   equ 0000h
RB0PPS_RB0PPS_SIZE                       equ 0006h
RB0PPS_RB0PPS_LENGTH                     equ 0006h
RB0PPS_RB0PPS_MASK                       equ 003Fh

// Register: RB1PPS
#define RB1PPS RB1PPS
RB1PPS                                   equ 01D95h
// bitfield definitions
RB1PPS_RB1PPS_POSN                       equ 0000h
RB1PPS_RB1PPS_POSITION                   equ 0000h
RB1PPS_RB1PPS_SIZE                       equ 0006h
RB1PPS_RB1PPS_LENGTH                     equ 0006h
RB1PPS_RB1PPS_MASK                       equ 003Fh

// Register: RB2PPS
#define RB2PPS RB2PPS
RB2PPS                                   equ 01D96h
// bitfield definitions
RB2PPS_RB2PPS_POSN                       equ 0000h
RB2PPS_RB2PPS_POSITION                   equ 0000h
RB2PPS_RB2PPS_SIZE                       equ 0006h
RB2PPS_RB2PPS_LENGTH                     equ 0006h
RB2PPS_RB2PPS_MASK                       equ 003Fh

// Register: RB3PPS
#define RB3PPS RB3PPS
RB3PPS                                   equ 01D97h
// bitfield definitions
RB3PPS_RB3PPS_POSN                       equ 0000h
RB3PPS_RB3PPS_POSITION                   equ 0000h
RB3PPS_RB3PPS_SIZE                       equ 0006h
RB3PPS_RB3PPS_LENGTH                     equ 0006h
RB3PPS_RB3PPS_MASK                       equ 003Fh

// Register: RB4PPS
#define RB4PPS RB4PPS
RB4PPS                                   equ 01D98h
// bitfield definitions
RB4PPS_RB4PPS_POSN                       equ 0000h
RB4PPS_RB4PPS_POSITION                   equ 0000h
RB4PPS_RB4PPS_SIZE                       equ 0006h
RB4PPS_RB4PPS_LENGTH                     equ 0006h
RB4PPS_RB4PPS_MASK                       equ 003Fh

// Register: RB5PPS
#define RB5PPS RB5PPS
RB5PPS                                   equ 01D99h
// bitfield definitions
RB5PPS_RB5PPS_POSN                       equ 0000h
RB5PPS_RB5PPS_POSITION                   equ 0000h
RB5PPS_RB5PPS_SIZE                       equ 0006h
RB5PPS_RB5PPS_LENGTH                     equ 0006h
RB5PPS_RB5PPS_MASK                       equ 003Fh

// Register: RB6PPS
#define RB6PPS RB6PPS
RB6PPS                                   equ 01D9Ah
// bitfield definitions
RB6PPS_RB6PPS_POSN                       equ 0000h
RB6PPS_RB6PPS_POSITION                   equ 0000h
RB6PPS_RB6PPS_SIZE                       equ 0006h
RB6PPS_RB6PPS_LENGTH                     equ 0006h
RB6PPS_RB6PPS_MASK                       equ 003Fh

// Register: RB7PPS
#define RB7PPS RB7PPS
RB7PPS                                   equ 01D9Bh
// bitfield definitions
RB7PPS_RB7PPS_POSN                       equ 0000h
RB7PPS_RB7PPS_POSITION                   equ 0000h
RB7PPS_RB7PPS_SIZE                       equ 0006h
RB7PPS_RB7PPS_LENGTH                     equ 0006h
RB7PPS_RB7PPS_MASK                       equ 003Fh

// Register: RC0PPS
#define RC0PPS RC0PPS
RC0PPS                                   equ 01D9Ch
// bitfield definitions
RC0PPS_RC0PPS_POSN                       equ 0000h
RC0PPS_RC0PPS_POSITION                   equ 0000h
RC0PPS_RC0PPS_SIZE                       equ 0006h
RC0PPS_RC0PPS_LENGTH                     equ 0006h
RC0PPS_RC0PPS_MASK                       equ 003Fh

// Register: RC1PPS
#define RC1PPS RC1PPS
RC1PPS                                   equ 01D9Dh
// bitfield definitions
RC1PPS_RC1PPS_POSN                       equ 0000h
RC1PPS_RC1PPS_POSITION                   equ 0000h
RC1PPS_RC1PPS_SIZE                       equ 0006h
RC1PPS_RC1PPS_LENGTH                     equ 0006h
RC1PPS_RC1PPS_MASK                       equ 003Fh

// Register: RC2PPS
#define RC2PPS RC2PPS
RC2PPS                                   equ 01D9Eh
// bitfield definitions
RC2PPS_RC2PPS_POSN                       equ 0000h
RC2PPS_RC2PPS_POSITION                   equ 0000h
RC2PPS_RC2PPS_SIZE                       equ 0006h
RC2PPS_RC2PPS_LENGTH                     equ 0006h
RC2PPS_RC2PPS_MASK                       equ 003Fh

// Register: RC3PPS
#define RC3PPS RC3PPS
RC3PPS                                   equ 01D9Fh
// bitfield definitions
RC3PPS_RC3PPS_POSN                       equ 0000h
RC3PPS_RC3PPS_POSITION                   equ 0000h
RC3PPS_RC3PPS_SIZE                       equ 0006h
RC3PPS_RC3PPS_LENGTH                     equ 0006h
RC3PPS_RC3PPS_MASK                       equ 003Fh

// Register: RC4PPS
#define RC4PPS RC4PPS
RC4PPS                                   equ 01DA0h
// bitfield definitions
RC4PPS_RC4PPS_POSN                       equ 0000h
RC4PPS_RC4PPS_POSITION                   equ 0000h
RC4PPS_RC4PPS_SIZE                       equ 0006h
RC4PPS_RC4PPS_LENGTH                     equ 0006h
RC4PPS_RC4PPS_MASK                       equ 003Fh

